; domain
(define (domain sokoban-sequential)
(:requirements :typing :negative-preconditions)
(:types location - object direction - object player_stone - object stone - player_stone player - player_stone)
(:predicates (is-goal ?0 - location) (is-nongoal ?0 - location) (move-dir ?0 - location ?1 - location ?2 - direction) (at ?0 - player_stone ?1 - location) (clear ?0 - location) (at-goal ?0 - stone))
(:action move
:parameters (?0player - player ?1location - location ?2location - location ?3direction - direction)
:precondition (and (move-dir ?1location ?2location ?3direction) (at ?0player ?1location) (clear ?2location)
(not (move-dir ?2location ?2location ?3direction)) (not (at ?0player ?2location)))
:effect (and (clear ?1location) (at ?0player ?2location)
(not (at ?0player ?1location)) (not (clear ?2location))))
(:action push-to-nongoal
:parameters (?0player - player ?1stone - stone ?2location - location ?3location - location ?4location - location ?5direction - direction)
:precondition (and (is-nongoal ?4location) (move-dir ?2location ?3location ?5direction) (move-dir ?3location ?4location ?5direction) (at ?0player ?2location) (at ?1stone ?3location) (clear ?4location)
(not (is-goal ?4location)) (not (move-dir ?4location ?4location ?5direction)) (not (at ?0player ?4location)) (not (at ?1stone ?4location)))
:effect (and (at ?0player ?3location) (clear ?2location) (at ?1stone ?4location)
(not (clear ?4location)) (not (at-goal ?1stone)) (not (at ?0player ?2location)) (not (at ?1stone ?3location))))
(:action push-to-goal
:parameters (?0player - player ?1stone - stone ?2location - location ?3location - location ?4location - location ?5direction - direction)
:precondition (and (is-goal ?4location) (move-dir ?2location ?3location ?5direction) (move-dir ?3location ?4location ?5direction) (at ?0player ?2location) (at ?1stone ?3location) (clear ?4location)
(not (is-nongoal ?4location)) (not (move-dir ?4location ?4location ?5direction)) (not (at ?0player ?4location)) (not (at ?1stone ?4location)))
:effect (and (at-goal ?1stone) (at ?0player ?3location) (clear ?2location) (at ?1stone ?4location)
(not (clear ?4location)) (not (at ?0player ?2location)) (not (at ?1stone ?3location))))
)

; problem
;; %#
;; $ 
;;   
;;   

(define (problem levels/level-1.lvl)
  (:domain sokoban-sequential)

  (:objects 
    dir-down - direction
    dir-left - direction
    dir-right - direction
    dir-up - direction
    pos-01-01 - location
    pos-02-01 - location
    pos-01-02 - location
    pos-02-02 - location
    pos-01-03 - location
    pos-02-03 - location
    pos-01-04 - location
    pos-02-04 - location
    player-01 - player
    stone-01 - stone
  )
  
  (:init 
    (IS-GOAL pos-01-01)
    (IS-NONGOAL pos-01-02)
    (IS-NONGOAL pos-01-03)
    (IS-NONGOAL pos-01-04)
    (IS-NONGOAL pos-02-01)
    (IS-NONGOAL pos-02-02)
    (IS-NONGOAL pos-02-03)
    (IS-NONGOAL pos-02-04)
    (MOVE-DIR pos-01-01 pos-01-02 dir-down)
    (MOVE-DIR pos-01-02 pos-01-01 dir-up)
    (MOVE-DIR pos-01-02 pos-01-03 dir-down)
    (MOVE-DIR pos-01-02 pos-02-02 dir-right)
    (MOVE-DIR pos-01-03 pos-01-02 dir-up)
    (MOVE-DIR pos-01-03 pos-01-04 dir-down)
    (MOVE-DIR pos-01-03 pos-02-03 dir-right)
    (MOVE-DIR pos-01-04 pos-01-03 dir-up)
    (MOVE-DIR pos-01-04 pos-02-04 dir-right)
    (MOVE-DIR pos-02-02 pos-01-02 dir-left)
    (MOVE-DIR pos-02-02 pos-02-03 dir-down)
    (MOVE-DIR pos-02-03 pos-01-03 dir-left)
    (MOVE-DIR pos-02-03 pos-02-02 dir-up)
    (MOVE-DIR pos-02-03 pos-02-04 dir-down)
    (MOVE-DIR pos-02-04 pos-01-04 dir-left)
    (MOVE-DIR pos-02-04 pos-02-03 dir-up)
    (at player-01 pos-01-01)
    (at stone-01 pos-01-02)
    (clear pos-01-03)
    (clear pos-01-04)
    (clear pos-02-02)
    (clear pos-02-03)
    (clear pos-02-04)
  )

  (:goal (and
    (at-goal stone-01)
  ))
)

; plan
1. (push-to-nongoal player-01 stone-01 pos-01-01 pos-01-02 pos-01-03 dir-down)
   deleted: (clear pos-01-03) (at player-01 pos-01-01) (at stone-01 pos-01-02)
   added: (at player-01 pos-01-02) (clear pos-01-01) (at stone-01 pos-01-03)
   goals met: 0 of 1
2. (move player-01 pos-01-02 pos-02-02 dir-right)
   deleted: (at player-01 pos-01-02) (clear pos-02-02)
   added: (clear pos-01-02) (at player-01 pos-02-02)
   goals met: 0 of 1
3. (move player-01 pos-02-02 pos-02-03 dir-down)
   deleted: (at player-01 pos-02-02) (clear pos-02-03)
   added: (clear pos-02-02) (at player-01 pos-02-03)
   goals met: 0 of 1
4. (move player-01 pos-02-03 pos-02-04 dir-down)
   deleted: (at player-01 pos-02-03) (clear pos-02-04)
   added: (clear pos-02-03) (at player-01 pos-02-04)
   goals met: 0 of 1
5. (move player-01 pos-02-04 pos-01-04 dir-left)
   deleted: (at player-01 pos-02-04) (clear pos-01-04)
   added: (clear pos-02-04) (at player-01 pos-01-04)
   goals met: 0 of 1
6. (push-to-nongoal player-01 stone-01 pos-01-04 pos-01-03 pos-01-02 dir-up)
   deleted: (clear pos-01-02) (at player-01 pos-01-04) (at stone-01 pos-01-03)
   added: (at player-01 pos-01-03) (clear pos-01-04) (at stone-01 pos-01-02)
   goals met: 0 of 1
7. (push-to-goal player-01 stone-01 pos-01-03 pos-01-02 pos-01-01 dir-up)
   deleted: (clear pos-01-01) (at player-01 pos-01-03) (at stone-01 pos-01-02)
   added: (at-goal stone-01) (at player-01 pos-01-02) (clear pos-01-03) (at stone-01 pos-01-01)
   goals met: 1 of 1
